import { ChronologyBlock } from "../watch/mod.chronology.js";


const callback = (screenshots) => {
    try {
        ChronologyBlock.block([
            37264, 29803, 31138, 51168, 33372, 34161, 36497, 36683, 34428, 35073, 37087, 37675, 37781, 38693, 48895, 48897, 57034, 48896, 61345, //Повелитель
            30831, 32380, 32937, 34626, 38040, 51958, 49458, 59833, 61203, // Этот замечательный мир
            31240, 33142, 33569, 42776, 38389, 36286, 39921, 38414, 41590, 39587, 42364, 42203, 54857, 60012, 61316, 63830, //Rezero
            32615, 34723, 34742, 37055, 40298, 49236, 49233, 34904, //Военная хроника маленькой девочки
            35790, 40356, 40357, 57907, 62564, //Восхождение героя щита
            48316, 53406, 54595, 56842, 62710, 57584 //Восхождение в тени!
        ], "system");
    } catch (err) {
        console.error('Error complete script', err);
    }
};

export default {
    on: {
        load: () => {
            callback();
        }
    }
}